posts/deploy-nikola-orgmode-on-travis/index.html
<!DOCTYPE html>
<html prefix="
og: http://ogp.me/ns# article: http://ogp.me/ns/article#
" vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>KK's Blog · Deploy Nikola OrgMode on Travis </title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="http://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700%7CAbril+Fatface">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://blog.fromkk.com/posts/deploy-nikola-orgmode-on-travis/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Kurt Lei">
<link rel="prev" href="../using-chinese-characters-in-matplotlib/" title="Using Chinese characters in Matplotlib" type="text/html">
<link rel="next" href="../create-node-benchmark-in-py2neo/" title="Create Node Benchmark in Py2neo" type="text/html">
<meta property="og:site_name" content="KK's Blog">
<meta property="og:title" content="Deploy Nikola OrgMode on Travis">
<meta property="og:url" content="https://blog.fromkk.com/posts/deploy-nikola-orgmode-on-travis/">
<meta property="og:description" content="Recently, I enjoy using =Spacemacs=, so I decided to switch to org file from Markdown for writing blog. After several attempts, I managed to let Travis convert org file to HTML. Here are the steps.


">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-11-03T20:20:45+08:00">
<meta property="article:tag" content="nikola">
<meta property="article:tag" content="travis">
</head>
<body class="theme-base-0d">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

    <div class="hsidebar">
        <div class="container sidebar-sticky">
            <div class="sidebar-about">
              <h1>
                <a href="https://blog.fromkk.com/">
                      <h1 id="brand"><a href="https://blog.fromkk.com/" title="KK's Blog" rel="home">

        <span id="blog-title">KK's Blog</span>
    </a></h1>

                </a>
              </h1>
                <p class="lead">KK's personal blog</p>

            </div>
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS feed</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2019         <a href="mailto:bebound%20gm@il.com">Kurt Lei</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>

    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Deploy Nikola OrgMode on Travis</a></h1>

    <span class="post-date">
      <time class="published dt-published" datetime="2018-11-03T20:20:45+08:00" itemprop="datePublished" title="2018-11-03 20:20">2018-11-03 20:20</time></span>

    
    

    <div class="e-content entry-content" itemprop="articleBody text">
    <p>
Recently, I enjoy using <code>=Spacemacs=</code>, so I decided to switch to org file from Markdown for writing blog. After several attempts, I managed to let Travis convert org file to HTML. Here are the steps.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Install orgmode plugin</h2>
<div class="outline-text-2" id="text-1">
<p>
First you need to install orgmode plugin on your computer following the official guide: <a href="https://plugins.getnikola.com/v8/orgmode/">Nikola orgmode plugin</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Edit <code>=conf.el=</code>
</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>=OrgMode=</code> will convert to HTML to display on Nikola. Orgmode plugin will call Emacs to do this job. When I run <code>=nikola build=</code>, it shows this message: <code>=Please install htmlize from https://github.com/hniksic/emacs-htmlize=</code>. I'm using <code>=Spacemacs=</code>, the <code>=htmlize=</code> package is already downloaded if the <code>=org=</code> layer is enabled. I just need to add htmlize folder to load-path. So here is the code:
</p>
<div class="highlight"><pre><span></span>(setq dir "~/.emacs.d/elpa/27.0/develop/")
(if(file-directory-p dir)
    (let ((default-directory dir))
      (normal-top-level-add-subdirs-to-load-path)))
(require 'htmlize)
</pre></div>

<p>
This package is also needed on Travis, the similar approach is required.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Modify <code>=.travis.yml=</code>
</h2>
<div class="outline-text-2" id="text-3">
<p>
Travis is using ubuntu 14.04, and the default Emacs version is 24, and the orgmode version is below 8.0, which not match the requirements. The easiest solution is to update Emacs to 25. So in the <code>=before_install=</code> section, add these code:
</p>
<div class="highlight"><pre><span></span>- sudo add-apt-repository ppa:kelleyk/emacs -y
- sudo apt-get update
</pre></div>
<p>
In the <code>=install=</code> section, add these code:
</p>
<div class="highlight"><pre><span></span>- sudo apt-get remove emacs
- sudo apt autoremove
- sudo apt-get install emacs25
</pre></div>

<p>
The default emacs doesn't contains <code>=htmlize=</code> package. So add <code>=git clone https://github.com/hniksic/emacs-htmlize ~/emacs-htmlize=</code> into <code>=before_install=</code> section.
</p>

<p>
Finally, modify <code>=conf.el=</code> for Travis Emacs, add GitHub repo to <code>=load-path=</code>: <code>=(add-to-list 'load-path "~/emacs-htmlize/")=</code>
</p>

<p>
Voila, the org file should show up.
</p>

<p>
The full <code>=.travis.yml=</code> is below:
</p>
<div class="highlight"><pre><span></span>language: python
cache: apt
sudo: false
addons:
  apt:
    packages:
    - language-pack-en-base
branches:
  only:
  - src
python:
- 3.6
before_install:
- sudo add-apt-repository ppa:kelleyk/emacs -y
- sudo apt-get update
- openssl aes-256-cbc -K $encrypted_a5c638e4bedc_key -iv $encrypted_a5c638e4bedc_iv
  -in travis.enc -out travis -d
- git config --global user.name 'bebound'
- git config --global user.email 'bebound@gmail.com'
- git config --global push.default 'simple'
- pip install --upgrade pip wheel
- echo -e 'Host github.com\n    StrictHostKeyChecking no' &gt;&gt; ~/.ssh/config
- eval "$(ssh-agent -s)"
- chmod 600 travis
- ssh-add travis
- git remote rm origin
- git remote add origin git@github.com:bebound/bebound.github.io
- git fetch origin master
- git branch master FETCH_HEAD
- git clone https://github.com/hniksic/emacs-htmlize ~/emacs-htmlize
install:
- pip install 'Nikola[extras]'==7.8.15
- sudo apt-get remove emacs
- sudo apt autoremove
- sudo apt-get install emacs25
script:
- nikola build &amp;&amp; nikola github_deploy -m 'Nikola auto deploy [ci skip]'
notifications:
  email:
    on_success: change
    on_failure: always
</pre></div>

<p>
And here is the <code>=conf.el=</code>:
</p>
<div class="highlight"><pre><span></span>(setq dir "~/.emacs.d/elpa/27.0/develop/")
(if(file-directory-p dir)
    (let ((default-directory dir))
      (normal-top-level-add-subdirs-to-load-path)))
(add-to-list 'load-path "~/emacs-htmlize/")
(require 'htmlize)
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><p itemprop="keywords" class="tags">
            <span class="tag"><a class="p-category" href="../../categories/nikola/" rel="tag">nikola</a></span>
            <span class="tag"><a class="p-category" href="../../categories/travis/" rel="tag">travis</a></span>
      </p>

            <div class="pager hidden-print pagination">

            <span class="previous pagination-item older">
                <a href="../using-chinese-characters-in-matplotlib/" rel="prev" title="Using Chinese characters in Matplotlib">
                Previous post
                </a>
            </span>


            <span class="next pagination-item newer">
                <a href="../create-node-benchmark-in-py2neo/" rel="next" title="Create Node Benchmark in Py2neo">
Next post
              </a>
            </span>

        </div>

    </nav></aside><section class="comments hidden-print"><h2>Comments</h2>
                        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="kkblog-1",
            disqus_url="https://blog.fromkk.com/posts/deploy-nikola-orgmode-on-travis/",
        disqus_title="Deploy Nikola OrgMode on Travis",
        disqus_identifier="cache/posts/deploy-nikola-orgmode-on-travis.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="kkblog-1";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>

    
    
        

</body>
</html>
